#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>



/*
	1 + 2 + 2 + 3 + 3 + 3...
	不难发现啊，其实是有规律的。第1天就发1枚金币，第2天就发2枚金币，以此类推；但是，以n枚金币发几天
	是有规定的！而不是第3天发3枚金币！第3天也是发2枚金币，换句话说：以2枚金币发2天，以3枚金币发3天....

	想象一下，如果老板发钱，第1批发1块，再发第2批2块，再发第3批3块

*/

// 方法1
//int main()
//{
//	int k = 0;
//	scanf("%d", &k);
//
//	int days = 0; // 天数
//	int coin = 0; // 金币
//	int i = 0;
//	for (i = 1;; i++) // 控制批次和金额
//	{
//		int j = 0;
//		for (j = 1; j <= i; j++) // 控制天数
//		{
//			days++; // 代表过了一天
//
//			// 判断是否<=天
//			if (days <= k)
//			{
//				coin += i; // 1+2+2+3+3
//			}
//			else
//			{
//				printf("%d\n", coin); // 超过了k天直接输出结果
//				return 0; // 提前结束程序
//			}
//		}
//	}
//
//
//	printf("%d\n", coin);
//
//	return 0;
//}


// 注：最外层循环没有写循环条件，是因为不知道轮才凑够k天，所以直接死循环，然后由内层循环决定是否到了k天






// 方法2
/*
	1. 第1天发1枚     （发1天）
	2. 第2~3天发2枚   （发2天
	3. 第4~6天发3枚   （发3天）
	4. 第7~10天发4枚   （发4天）
	...

	每天只发一种固定金币数，发够天数了，就换成下一个数字
*/

int main()
{
	int k = 0;
	scanf("%d", &k);

	int total = 0; // 总金币
	int coin = 1; // 当天要发的金币
	int count = 0; // 计数器
	int day = 0;
	for (day = 1; day <= k; day++)
	{
		total += coin; // 加当天金币
		count++; // 记录发了几天

		if (count == coin) // 发够了天数就换成下一个面值
		{
			coin++; 
			count = 0; // 重新记录天数
		}

	}
	
	printf("%d\n", total);

	return 0;
}